{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "'": 4,
      ",": 5,
      "-": 6,
      ".": 7,
      "E": 8,
      "I": 9,
      "R": 10,
      "T": 11,
      "Y": 12,
      "a": 13,
      "b": 14,
      "c": 15,
      "d": 16,
      "e": 17,
      "f": 18,
      "g": 19,
      "h": 20,
      "i": 21,
      "k": 22,
      "l": 23,
      "m": 24,
      "n": 25,
      "o": 26,
      "p": 27,
      "r": 28,
      "s": 29,
      "t": 30,
      "u": 31,
      "v": 32,
      "w": 33,
      "x": 34,
      "y": 35,
      "z": 36,
      "Ċ": 37,
      "Ġ": 38,
      "Ġt": 39,
      "er": 40,
      "is": 41,
      "he": 42,
      "an": 43,
      "il": 44,
      "or": 45,
      "Ġf": 46,
      "Ġw": 47,
      "ac": 48,
      "al": 49,
      "at": 50,
      "en": 51,
      "es": 52,
      "ex": 53,
      "his": 54,
      "ou": 55,
      "pu": 56,
      "you": 57,
      "Ġm": 58,
      "Ġyou": 59,
      "Ġto": 60,
      "Ġthe": 61,
      "Ġtex": 62,
      "Ġtext": 63,
      "'s": 64,
      "Ya": 65,
      "ar": 66,
      "de": 67,
      "ep": 68,
      "et": 69,
      "in": 70,
      "it": 71,
      "iz": 72,
      "ken": 73,
      "lac": 74,
      "ny": 75,
      "on": 76,
      "ode": 77,
      "Ġb": 78,
      "Ġc": 79,
      "Ġp": 80,
      "Ġr": 81,
      "Ġis": 82,
      "Ġan": 83,
      "ĠYa": 84,
      "Ġthis": 85,
      "ile": 86,
      "ill": 87,
      "Ġfile": 88,
      "Ġwill": 89,
      "puny": 90,
      "Ġyour": 91,
      "Ġtoken": 92,
      "izer": 93,
      "lace": 94,
      "ĠYapuny": 95,
      "Ġtokenizer": 96
    },
    "merges": [
      [
        "Ġ",
        "t"
      ],
      [
        "e",
        "r"
      ],
      [
        "i",
        "s"
      ],
      [
        "h",
        "e"
      ],
      [
        "a",
        "n"
      ],
      [
        "i",
        "l"
      ],
      [
        "o",
        "r"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "a",
        "c"
      ],
      [
        "a",
        "l"
      ],
      [
        "a",
        "t"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "x"
      ],
      [
        "h",
        "is"
      ],
      [
        "o",
        "u"
      ],
      [
        "p",
        "u"
      ],
      [
        "y",
        "ou"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "Ġ",
        "you"
      ],
      [
        "Ġt",
        "o"
      ],
      [
        "Ġt",
        "he"
      ],
      [
        "Ġt",
        "ex"
      ],
      [
        "Ġtex",
        "t"
      ],
      [
        "'",
        "s"
      ],
      [
        "Y",
        "a"
      ],
      [
        "a",
        "r"
      ],
      [
        "d",
        "e"
      ],
      [
        "e",
        "p"
      ],
      [
        "e",
        "t"
      ],
      [
        "i",
        "n"
      ],
      [
        "i",
        "t"
      ],
      [
        "i",
        "z"
      ],
      [
        "k",
        "en"
      ],
      [
        "l",
        "ac"
      ],
      [
        "n",
        "y"
      ],
      [
        "o",
        "n"
      ],
      [
        "o",
        "de"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "Ġ",
        "r"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "Ġ",
        "an"
      ],
      [
        "Ġ",
        "Ya"
      ],
      [
        "Ġt",
        "his"
      ],
      [
        "il",
        "e"
      ],
      [
        "il",
        "l"
      ],
      [
        "Ġf",
        "ile"
      ],
      [
        "Ġw",
        "ill"
      ],
      [
        "pu",
        "ny"
      ],
      [
        "Ġyou",
        "r"
      ],
      [
        "Ġto",
        "ken"
      ],
      [
        "iz",
        "er"
      ],
      [
        "lac",
        "e"
      ],
      [
        "ĠYa",
        "puny"
      ],
      [
        "Ġtoken",
        "izer"
      ]
    ]
  }
}